src/main/java/com/lld/problems/elevator/notes/notes.md
```mermaid
sequenceDiagram
    participant Main
    participant Elevator
    participant Door

    loop until pendingStops empty
        Main->>Elevator: moveOneStep()
        Elevator->>Elevator: currFloor = new Floor(nextFloorNumber)
        Elevator->>Elevator: findFirstStop(): Button
        alt floor is in pendingStops
            Elevator->>Door: open()
            Elevator->>Door: close()
            Elevator->>Elevator: pendingStops.remove(button)
        else floor not in pendingStops
            Note over Elevator: continue moving
        end
    end
```
